export type PaymentCategory = {
    value: string,
    name: string
}

export const nonBudgetPaymentCategories: PaymentCategory[] = [
    { value: "1", name: "Інші платежі" },
    { value: "2", name: "Комунальні послуги (ОСББ, ЖБК, світло, вода, електроенергія, домофон, сміття, ліфт, охорона, паркінг, гараж)" },
    { value: "6", name: "Інтернет/Телебачення/Телеком послуги" },
    { value: "3", name: "Оплата товарів та послуг (оплата рахунку, замовлення)" },
    { value: "5", name: "Погашення кредиту" },
    { value: "7", name: "Страхування (страхові платежі)" },
    { value: "8", name: "Навчання (школа, дитячий садок (харчування, батьківська плата), вебінари, семінари, курси, онлайн навчання тощо)" },
    { value: "9", name: "Благодійні внески" }
];

export const budgetPaymentCategories: PaymentCategory[] = [
    { value: "101", name: "101 Сплата суми податків і зборів / єдиного внеску" },
    { value: "109", name: "109 Оплата податкового векселя" },
    { value: "121", name: "121 Сплата адміністративного штрафу" },
    { value: "125", name: "125 Авансові внески, нараховані на суму дивідендів та прирівняних до них платежів" },
    { value: "128", name: "128 Сплата суми податків, зборів / єдиного внеску, визначених за результатами камеральної перевірки підрозділів податків і зборів з фізичних осіб" },
    { value: "130", name: "130 Сплата грошового зобов'язання, визначеного за результатами камеральної перевірки підрозділів податків і зборів з юридичних осіб" },
    { value: "131", name: "131 Сплата грошового зобов'язання, визначеного за результатами документальної/фактичної перевірки підрозділів аудиту" },
    { value: "133", name: "133 Сплата суми податків і зборів, єдиного внеску, штрафних (фінансових) санкцій, пені, визначених за результатами документальної/фактичної перевірки підрозділів податків і зборів з фізичних осіб" },
    { value: "134", name: "134 Сплата грошового зобов'язання, визначеного за результатами перевірки підрозділів аудиту (інші надходження)" },
    { value: "135", name: "135 Сплата фінансових санкцій, визначених підрозділом податків і зборів з юридичних осіб" },
    { value: "137", name: "137 Сплата грошового зобов'язання, визначеного територіальним органом ДФС за результатами роботи інших підрозділів" },
    { value: "138", name: "138 Сплата грошового зобов'язання, визначеного за результатами перевірки підрозділів податків і зборів з фізичних осіб (інші надходження)" },
    { value: "140", name: "140 Надходження до бюджету коштів у рахунок погашення податкового боргу / недоїмки з єдиного внеску" },
    { value: "145", name: "145 Надходження розстрочених (відстрочених) сум" },
    { value: "244", name: "244 Сплата податкового зобов'язання за уточнюючим розрахунком у разі застосування податкового компромісу" },
    { value: "246", name: "246 Сплата податкового зобов'язання за податковим повідомленням-рішенням у разі застосування податкового компромісу" },
    { value: "350", name: "350 Передоплата (доплата) митних платежів" },
    { value: "354", name: "354 Сплата грошового зобов'язання, визначеного за результатами документальної невиїзної перевірки підрозділів аудиту" },
    { value: "355", name: "355 Сплата грошового зобов'язання, визначеного за результатами документальної виїзної перевірки підрозділів аудиту" }
];
